chenjiawei180/STM32-RE/USER/menu.c
 /******************************************************************************
  * @file       USER/menu.c
  * @author  cjw
  * @date     2016.1.28
  * @brief     This file contains the source of the menu.
  ******************************************************************************/
#include "menu.h"
#include "tm1629.h"
#include "usart2.h"
#include "key.h"
#include "rf_app.h"
#include "gd5800.h"
#include "stm32_rtc.h"
#include "transmit.h"

#if defined MENU_GLOBAL

u8 Remove_Call_Time = 0 ;
u8 Cycle_Call_Time = 0;

u8 Change_Standby_Display_Mode = 0;    /* FC */
u8 Set_Key_Remove_Call_Is_Or_Not = 0;    /* FB */

u8 Register_Call_Buff[5]={0,0,0,1,0};
u8 Delete_Call_Buff[5]={0,0,0,1,0};
u8 Register_Host_Buff[5]={0,0,0,1,0};
u8 Delete_Host_Buff[5]={0,0,0,1,0};
u8 Register_Alarm_Buff[5]={0,0,0,1,0};
u8 Delete_Alarm_Buff[5]={0,0,0,1,0};
u8 Register_Cancel_Buff[5]={0,0,0,1,0};
u8 Delete_Cancel_Buff[5]={0,0,0,1,0};

u8 Set_Call_Queue_Mode = 1;
u8 Set_Call_Display_Number= 10;
u8 Set_Voice_Play_Mode = 0;
u8 Set_Voice_Play_Time = 1;
u8 Set_Voice_Play_Is_Or_Not_In_Cycle_Mode = 0;
u8 Set_Voice_Volume = 6;
u8 Set_Display_Tube_Brightness = 3;
u8 Set_Voice_Navigation_On_Or_OFF = 1 ;
u8 Set_Voice_Navigation_Mode = 0;    // 1 is chinese   0 is english  
u8 Set_Display_LED_Mode = 0;

u8 Set_Two_Menu_F7_E1 = 11;
u8 Set_Two_Menu_F7_E2 = 0;
u8 Set_Two_Menu_F7_E3 = 0;
u8 Set_Two_Menu_F7_E4 = 0;

u8 Set_Singal_Or_Multiple_Key_Mode = 2;
u8 Set_Key_Of_Call_Mode = 0 ;

u32 Return_Standby_Time_Count = 0;

u8 Set_Singal_Or_Multiple_Key_Mode_Bak = 0;

/**
  * @brief  This is Menu index.
  * @param  None
  * @retval None
  */

const struct Menu_def MenuProc[]=
{
    {STANDBY_MENU,  STANDBY_MENU, STANDBY_MENU, STANDBY_MENU,STANDBY_MENU,Menu_Standby},  
    {ONE_MENU_F0,  TWO_MENU_F0_MINUTE, ONE_MENU_FE, ONE_MENU_F1,STANDBY_MENU,Menu_F0},  
    {ONE_MENU_F1,  TWO_MENU_F1_E1, ONE_MENU_F0, ONE_MENU_F2,STANDBY_MENU,Menu_F1},  
    {ONE_MENU_F2,  TWO_MENU_F2_E1, ONE_MENU_F1, ONE_MENU_F3,STANDBY_MENU,Menu_F2},  
    {ONE_MENU_F3,  TWO_MENU_F3_E1, ONE_MENU_F2, ONE_MENU_F4,STANDBY_MENU,Menu_F3},  
    {ONE_MENU_F4,  TWO_MENU_F4_SET, ONE_MENU_F3, ONE_MENU_F5,STANDBY_MENU,Menu_F4}, 
    {ONE_MENU_F5,  TWO_MENU_F5_SET, ONE_MENU_F4, ONE_MENU_F6,STANDBY_MENU,Menu_F5},  
    {ONE_MENU_F6,  TWO_MENU_F6_E1, ONE_MENU_F5, ONE_MENU_F7,STANDBY_MENU,Menu_F6},  
    {ONE_MENU_F7,  TWO_MENU_F7_E1, ONE_MENU_F6, ONE_MENU_F8,STANDBY_MENU,Menu_F7},  
    {ONE_MENU_F8,  TWO_MENU_F8_E1, ONE_MENU_F7, ONE_MENU_F9,STANDBY_MENU,Menu_F8},  
    {ONE_MENU_F9,  TWO_MENU_F9_E1, ONE_MENU_F8, ONE_MENU_FA,STANDBY_MENU,Menu_F9},  
    {ONE_MENU_FA,  ONE_MENU_FA, ONE_MENU_F9, ONE_MENU_FB,STANDBY_MENU,Menu_FA},  
    {ONE_MENU_FB,  ONE_MENU_FB, ONE_MENU_FA,ONE_MENU_FC,STANDBY_MENU,Menu_FB},  
    {ONE_MENU_FC,  ONE_MENU_FC, ONE_MENU_FB, ONE_MENU_FD,STANDBY_MENU,Menu_FC},  
    {ONE_MENU_FD,  ONE_MENU_FD, ONE_MENU_FC, ONE_MENU_FE,STANDBY_MENU,Menu_FD},  
    {ONE_MENU_FE,  ONE_MENU_FE, ONE_MENU_FD, ONE_MENU_F0,STANDBY_MENU,Menu_FE},

    {TWO_MENU_F0_MINUTE,  TWO_MENU_F0_HOUR, TWO_MENU_F0_MINUTE, TWO_MENU_F0_MINUTE,ONE_MENU_F0,Menu_F0_Minute},
    {TWO_MENU_F0_HOUR,  TWO_MENU_F0_DAY, TWO_MENU_F0_HOUR, TWO_MENU_F0_HOUR,ONE_MENU_F0,Menu_F0_Hour},
    {TWO_MENU_F0_DAY,  TWO_MENU_F0_MONTH, TWO_MENU_F0_DAY, TWO_MENU_F0_DAY,ONE_MENU_F0,Menu_F0_Day},
    {TWO_MENU_F0_MONTH,  TWO_MENU_F0_YEAR, TWO_MENU_F0_MONTH, TWO_MENU_F0_MONTH,ONE_MENU_F0,Menu_F0_Month},
    {TWO_MENU_F0_YEAR,  TWO_MENU_F0_WEEK, TWO_MENU_F0_YEAR, TWO_MENU_F0_YEAR,ONE_MENU_F0,Menu_F0_Year},
    {TWO_MENU_F0_WEEK,  TWO_MENU_F0_MINUTE, TWO_MENU_F0_WEEK, TWO_MENU_F0_WEEK,ONE_MENU_F0,Menu_F0_Week},    

    {TWO_MENU_F1_E1,  THREE_MENU_F1_E1_D1, TWO_MENU_F1_E4, TWO_MENU_F1_E2,ONE_MENU_F1,Menu_F1_E1},
    {TWO_MENU_F1_E2,  THREE_MENU_F1_E2_D1, TWO_MENU_F1_E1, TWO_MENU_F1_E3,ONE_MENU_F1,Menu_F1_E2},
    {TWO_MENU_F1_E3,  THREE_MENU_F1_E3_D1, TWO_MENU_F1_E2, TWO_MENU_F1_E4,ONE_MENU_F1,Menu_F1_E3},
    {TWO_MENU_F1_E4,  THREE_MENU_F1_E4_D1, TWO_MENU_F1_E3, TWO_MENU_F1_E1,ONE_MENU_F1,Menu_F1_E4},
    
    {TWO_MENU_F2_E1,  THREE_MENU_F2_E1_D1, TWO_MENU_F2_E4, TWO_MENU_F2_E2,ONE_MENU_F2,Menu_F2_E1},
    {TWO_MENU_F2_E2,  THREE_MENU_F2_E2_D1, TWO_MENU_F2_E1, TWO_MENU_F2_E3,ONE_MENU_F2,Menu_F2_E2},
    {TWO_MENU_F2_E3,  THREE_MENU_F2_E3_D1, TWO_MENU_F2_E2, TWO_MENU_F2_E4,ONE_MENU_F2,Menu_F2_E3},
    {TWO_MENU_F2_E4,  THREE_MENU_F2_E4_D1, TWO_MENU_F2_E3, TWO_MENU_F2_E1,ONE_MENU_F2,Menu_F2_E4},

    {TWO_MENU_F3_E1,  THREE_MENU_F3_E1_SET, TWO_MENU_F3_E2, TWO_MENU_F3_E2,ONE_MENU_F3,Menu_F3_E1},
    {TWO_MENU_F3_E2,  THREE_MENU_F3_E2_SET, TWO_MENU_F3_E1, TWO_MENU_F3_E1,ONE_MENU_F3,Menu_F3_E2},

    {TWO_MENU_F4_SET,  TWO_MENU_F4_SET, TWO_MENU_F4_SET, TWO_MENU_F4_SET,ONE_MENU_F4,Menu_F4_Set},
    {TWO_MENU_F5_SET,  TWO_MENU_F5_SET, TWO_MENU_F5_SET, TWO_MENU_F5_SET,ONE_MENU_F5,Menu_F5_Set},

    {TWO_MENU_F6_E1,  THREE_MENU_F6_E1_SET, TWO_MENU_F6_E8, TWO_MENU_F6_E2,ONE_MENU_F6,Menu_F6_E1},
    {TWO_MENU_F6_E2,  THREE_MENU_F6_E2_SET, TWO_MENU_F6_E1, TWO_MENU_F6_E3,ONE_MENU_F6,Menu_F6_E2},
    {TWO_MENU_F6_E3,  THREE_MENU_F6_E3_SET, TWO_MENU_F6_E2, TWO_MENU_F6_E4,ONE_MENU_F6,Menu_F6_E3},
    {TWO_MENU_F6_E4,  THREE_MENU_F6_E4_SET, TWO_MENU_F6_E3, TWO_MENU_F6_E5,ONE_MENU_F6,Menu_F6_E4},
    {TWO_MENU_F6_E5,  THREE_MENU_F6_E5_SET, TWO_MENU_F6_E4, TWO_MENU_F6_E6,ONE_MENU_F6,Menu_F6_E5},
    {TWO_MENU_F6_E6,  THREE_MENU_F6_E6_SET, TWO_MENU_F6_E5, TWO_MENU_F6_E7,ONE_MENU_F6,Menu_F6_E6},
    {TWO_MENU_F6_E7,  THREE_MENU_F6_E7_SET, TWO_MENU_F6_E6, TWO_MENU_F6_E8,ONE_MENU_F6,Menu_F6_E7},
    {TWO_MENU_F6_E8,  THREE_MENU_F6_E8_SET, TWO_MENU_F6_E7, TWO_MENU_F6_E1,ONE_MENU_F6,Menu_F6_E8},

    {TWO_MENU_F7_E1,  THREE_MENU_F7_E1_SET, TWO_MENU_F7_E4, TWO_MENU_F7_E2,ONE_MENU_F7,Menu_F7_E1},
    {TWO_MENU_F7_E2,  THREE_MENU_F7_E2_SET, TWO_MENU_F7_E1, TWO_MENU_F7_E3,ONE_MENU_F7,Menu_F7_E2},
    {TWO_MENU_F7_E3,  THREE_MENU_F7_E3_SET, TWO_MENU_F7_E2, TWO_MENU_F7_E4,ONE_MENU_F7,Menu_F7_E3},
    {TWO_MENU_F7_E4,  THREE_MENU_F7_E4_SET, TWO_MENU_F7_E3, TWO_MENU_F7_E1,ONE_MENU_F7,Menu_F7_E4},

