chenjiawei180/STM32-RE/USER/menu.c
    {TWO_MENU_F8_E1,  THREE_MENU_F8_E1_SET, TWO_MENU_F8_E2, TWO_MENU_F8_E2,ONE_MENU_F8,Menu_F8_E1},
    {TWO_MENU_F8_E2,  THREE_MENU_F8_E2_SET, TWO_MENU_F8_E1, TWO_MENU_F8_E1,ONE_MENU_F8,Menu_F8_E2},

    {TWO_MENU_F9_E1,  TWO_MENU_F9_E1, TWO_MENU_F9_E2, TWO_MENU_F9_E2,ONE_MENU_F9,Menu_F9_E1},
    {TWO_MENU_F9_E2,  TWO_MENU_F9_E2, TWO_MENU_F9_E1, TWO_MENU_F9_E1,ONE_MENU_F9,Menu_F9_E2},    

    {TWO_MENU_FA_SET,  TWO_MENU_FA_SET, TWO_MENU_FA_SET, TWO_MENU_FA_SET,ONE_MENU_FA,Menu_FA_Set},
    {TWO_MENU_FB_SET,  TWO_MENU_FB_SET, TWO_MENU_FB_SET, TWO_MENU_FB_SET,ONE_MENU_FB,Menu_FB_Set},
    {TWO_MENU_FC_SET,  TWO_MENU_FC_SET, TWO_MENU_FC_SET, TWO_MENU_FC_SET,ONE_MENU_FC,Menu_FC_Set},
    {TWO_MENU_FD_SET,  TWO_MENU_FD_SET, TWO_MENU_FD_SET, TWO_MENU_FD_SET,ONE_MENU_FD,Menu_FD_Set},
    {TWO_MENU_FE_E1,  TWO_MENU_FE_E1, TWO_MENU_FE_E2, TWO_MENU_FE_E2,ONE_MENU_FE,Menu_FE_E1},
    {TWO_MENU_FE_E2,  TWO_MENU_FE_E2, TWO_MENU_FE_E1, TWO_MENU_FE_E1,ONE_MENU_FE,Menu_FE_E2},    

    {THREE_MENU_F1_E1_D1,  THREE_MENU_F1_E1_D2, THREE_MENU_F1_E1_D1, THREE_MENU_F1_E1_D1,TWO_MENU_F1_E1,Menu_F1_E1_D1},  
    {THREE_MENU_F1_E1_D2,  THREE_MENU_F1_E1_D3, THREE_MENU_F1_E1_D2, THREE_MENU_F1_E1_D2,TWO_MENU_F1_E1,Menu_F1_E1_D2},
    {THREE_MENU_F1_E1_D3,  THREE_MENU_F1_E1_D4, THREE_MENU_F1_E1_D3, THREE_MENU_F1_E1_D3,TWO_MENU_F1_E1,Menu_F1_E1_D3},
    {THREE_MENU_F1_E1_D4,  THREE_MENU_F1_E1_D1, THREE_MENU_F1_E1_D4, THREE_MENU_F1_E1_D4,TWO_MENU_F1_E1,Menu_F1_E1_D4},

    {THREE_MENU_F1_E2_D1,  THREE_MENU_F1_E2_D2, THREE_MENU_F1_E2_D1, THREE_MENU_F1_E2_D1,TWO_MENU_F1_E2,Menu_F1_E2_D1},  
    {THREE_MENU_F1_E2_D2,  THREE_MENU_F1_E2_D3, THREE_MENU_F1_E2_D2, THREE_MENU_F1_E2_D2,TWO_MENU_F1_E2,Menu_F1_E2_D2},
    {THREE_MENU_F1_E2_D3,  THREE_MENU_F1_E2_D4, THREE_MENU_F1_E2_D3, THREE_MENU_F1_E2_D3,TWO_MENU_F1_E2,Menu_F1_E2_D3},
    {THREE_MENU_F1_E2_D4,  THREE_MENU_F1_E2_D1, THREE_MENU_F1_E2_D4, THREE_MENU_F1_E2_D4,TWO_MENU_F1_E2,Menu_F1_E2_D4},

    {THREE_MENU_F1_E3_D1,  THREE_MENU_F1_E3_D2, THREE_MENU_F1_E3_D1, THREE_MENU_F1_E3_D1,TWO_MENU_F1_E3,Menu_F1_E3_D1},  
    {THREE_MENU_F1_E3_D2,  THREE_MENU_F1_E3_D3, THREE_MENU_F1_E3_D2, THREE_MENU_F1_E3_D2,TWO_MENU_F1_E3,Menu_F1_E3_D2},
    {THREE_MENU_F1_E3_D3,  THREE_MENU_F1_E3_D4, THREE_MENU_F1_E3_D3, THREE_MENU_F1_E3_D3,TWO_MENU_F1_E3,Menu_F1_E3_D3},
    {THREE_MENU_F1_E3_D4,  THREE_MENU_F1_E3_D1, THREE_MENU_F1_E3_D4, THREE_MENU_F1_E3_D4,TWO_MENU_F1_E3,Menu_F1_E3_D4},

    {THREE_MENU_F1_E4_D1,  THREE_MENU_F1_E4_D2, THREE_MENU_F1_E4_D1, THREE_MENU_F1_E4_D1,TWO_MENU_F1_E4,Menu_F1_E4_D1},  
    {THREE_MENU_F1_E4_D2,  THREE_MENU_F1_E4_D3, THREE_MENU_F1_E4_D2, THREE_MENU_F1_E4_D2,TWO_MENU_F1_E4,Menu_F1_E4_D2},
    {THREE_MENU_F1_E4_D3,  THREE_MENU_F1_E4_D4, THREE_MENU_F1_E4_D3, THREE_MENU_F1_E4_D3,TWO_MENU_F1_E4,Menu_F1_E4_D3},
    {THREE_MENU_F1_E4_D4,  THREE_MENU_F1_E4_D1, THREE_MENU_F1_E4_D4, THREE_MENU_F1_E4_D4,TWO_MENU_F1_E4,Menu_F1_E4_D4},

    {THREE_MENU_F2_E1_D1,  THREE_MENU_F2_E1_D2, THREE_MENU_F2_E1_D1, THREE_MENU_F2_E1_D1,TWO_MENU_F2_E1,Menu_F2_E1_D1},  
    {THREE_MENU_F2_E1_D2,  THREE_MENU_F2_E1_D3, THREE_MENU_F2_E1_D2, THREE_MENU_F2_E1_D2,TWO_MENU_F2_E1,Menu_F2_E1_D2},
    {THREE_MENU_F2_E1_D3,  THREE_MENU_F2_E1_D4, THREE_MENU_F2_E1_D3, THREE_MENU_F2_E1_D3,TWO_MENU_F2_E1,Menu_F2_E1_D3},
    {THREE_MENU_F2_E1_D4,  THREE_MENU_F2_E1_D1, THREE_MENU_F2_E1_D4, THREE_MENU_F2_E1_D4,TWO_MENU_F2_E1,Menu_F2_E1_D4},

    {THREE_MENU_F2_E2_D1,  THREE_MENU_F2_E2_D2, THREE_MENU_F2_E2_D1, THREE_MENU_F2_E2_D1,TWO_MENU_F2_E2,Menu_F2_E2_D1},  
    {THREE_MENU_F2_E2_D2,  THREE_MENU_F2_E2_D3, THREE_MENU_F2_E2_D2, THREE_MENU_F2_E2_D2,TWO_MENU_F2_E2,Menu_F2_E2_D2},
    {THREE_MENU_F2_E2_D3,  THREE_MENU_F2_E2_D4, THREE_MENU_F2_E2_D3, THREE_MENU_F2_E2_D3,TWO_MENU_F2_E2,Menu_F2_E2_D3},
    {THREE_MENU_F2_E2_D4,  THREE_MENU_F2_E2_D1, THREE_MENU_F2_E2_D4, THREE_MENU_F2_E2_D4,TWO_MENU_F2_E2,Menu_F2_E2_D4},

    {THREE_MENU_F2_E3_D1,  THREE_MENU_F2_E3_D2, THREE_MENU_F2_E3_D1, THREE_MENU_F2_E3_D1,TWO_MENU_F2_E3,Menu_F2_E3_D1},  
    {THREE_MENU_F2_E3_D2,  THREE_MENU_F2_E3_D3, THREE_MENU_F2_E3_D2, THREE_MENU_F2_E3_D2,TWO_MENU_F2_E3,Menu_F2_E3_D2},
    {THREE_MENU_F2_E3_D3,  THREE_MENU_F2_E3_D4, THREE_MENU_F2_E3_D3, THREE_MENU_F2_E3_D3,TWO_MENU_F2_E3,Menu_F2_E3_D3},
    {THREE_MENU_F2_E3_D4,  THREE_MENU_F2_E3_D1, THREE_MENU_F2_E3_D4, THREE_MENU_F2_E3_D4,TWO_MENU_F2_E3,Menu_F2_E3_D4},

    {THREE_MENU_F2_E4_D1,  THREE_MENU_F2_E4_D2, THREE_MENU_F2_E4_D1, THREE_MENU_F2_E4_D1,TWO_MENU_F2_E4,Menu_F2_E4_D1},  
    {THREE_MENU_F2_E4_D2,  THREE_MENU_F2_E4_D3, THREE_MENU_F2_E4_D2, THREE_MENU_F2_E4_D2,TWO_MENU_F2_E4,Menu_F2_E4_D2},
    {THREE_MENU_F2_E4_D3,  THREE_MENU_F2_E4_D4, THREE_MENU_F2_E4_D3, THREE_MENU_F2_E4_D3,TWO_MENU_F2_E4,Menu_F2_E4_D3},
    {THREE_MENU_F2_E4_D4,  THREE_MENU_F2_E4_D1, THREE_MENU_F2_E4_D4, THREE_MENU_F2_E4_D4,TWO_MENU_F2_E4,Menu_F2_E4_D4},

    {THREE_MENU_F3_E1_SET,  THREE_MENU_F3_E1_SET, THREE_MENU_F3_E1_SET, THREE_MENU_F3_E1_SET,TWO_MENU_F3_E1,Menu_F3_E1_Set},    
    {THREE_MENU_F3_E2_SET,  THREE_MENU_F3_E2_SET, THREE_MENU_F3_E2_SET, THREE_MENU_F3_E2_SET,TWO_MENU_F3_E2,Menu_F3_E2_Set},    

    {THREE_MENU_F6_E1_SET,  THREE_MENU_F6_E1_SET, THREE_MENU_F6_E1_SET, THREE_MENU_F6_E1_SET,TWO_MENU_F6_E1,Menu_F6_E1_Set},      
    {THREE_MENU_F6_E2_SET,  THREE_MENU_F6_E2_SET, THREE_MENU_F6_E2_SET, THREE_MENU_F6_E2_SET,TWO_MENU_F6_E2,Menu_F6_E2_Set},    
    {THREE_MENU_F6_E3_SET,  THREE_MENU_F6_E3_SET, THREE_MENU_F6_E3_SET, THREE_MENU_F6_E3_SET,TWO_MENU_F6_E3,Menu_F6_E3_Set},    
    {THREE_MENU_F6_E4_SET,  THREE_MENU_F6_E4_SET, THREE_MENU_F6_E4_SET, THREE_MENU_F6_E4_SET,TWO_MENU_F6_E4,Menu_F6_E4_Set},    
    {THREE_MENU_F6_E5_SET,  THREE_MENU_F6_E5_SET, THREE_MENU_F6_E5_SET, THREE_MENU_F6_E5_SET,TWO_MENU_F6_E5,Menu_F6_E5_Set},    
    {THREE_MENU_F6_E6_SET,  THREE_MENU_F6_E6_SET, THREE_MENU_F6_E6_SET, THREE_MENU_F6_E6_SET,TWO_MENU_F6_E6,Menu_F6_E6_Set},    
    {THREE_MENU_F6_E7_SET,  THREE_MENU_F6_E7_SET, THREE_MENU_F6_E7_SET, THREE_MENU_F6_E7_SET,TWO_MENU_F6_E7,Menu_F6_E7_Set},    
    {THREE_MENU_F6_E8_SET,  THREE_MENU_F6_E8_SET, THREE_MENU_F6_E8_SET, THREE_MENU_F6_E8_SET,TWO_MENU_F6_E8,Menu_F6_E8_Set},    

