chenjiawei180/STM32-RE/USER/menu.c
    {THREE_MENU_F7_E1_SET,  THREE_MENU_F7_E1_SET, THREE_MENU_F7_E1_SET, THREE_MENU_F7_E1_SET,TWO_MENU_F7_E1,Menu_F7_E1_Set},      
    {THREE_MENU_F7_E2_SET,  THREE_MENU_F7_E2_SET, THREE_MENU_F7_E2_SET, THREE_MENU_F7_E2_SET,TWO_MENU_F7_E2,Menu_F7_E2_Set},    
    {THREE_MENU_F7_E3_SET,  THREE_MENU_F7_E3_SET, THREE_MENU_F7_E3_SET, THREE_MENU_F7_E3_SET,TWO_MENU_F7_E3,Menu_F7_E3_Set},    
    {THREE_MENU_F7_E4_SET,  THREE_MENU_F7_E4_SET, THREE_MENU_F7_E4_SET, THREE_MENU_F7_E4_SET,TWO_MENU_F7_E4,Menu_F7_E4_Set},   

    {THREE_MENU_F8_E1_SET,  THREE_MENU_F8_E1_SET, THREE_MENU_F8_E1_SET, THREE_MENU_F8_E1_SET,TWO_MENU_F8_E1,Menu_F8_E1_Set},      
    {THREE_MENU_F8_E2_SET,  THREE_MENU_F8_E2_SET, THREE_MENU_F8_E2_SET, THREE_MENU_F8_E2_SET,TWO_MENU_F8_E2,Menu_F8_E2_Set},    

    {THREE_MENU_FE_E1_SET,  THREE_MENU_FE_E1_SET, THREE_MENU_FE_E1_SET, THREE_MENU_FE_E1_SET,TWO_MENU_FE_E1,Menu_F0},      
    {THREE_MENU_FE_E2_SET,  THREE_MENU_FE_E2_SET, THREE_MENU_FE_E2_SET, THREE_MENU_FE_E2_SET,TWO_MENU_FE_E2,Menu_F0},    

    {DECODER_MENU,  DECODER_MENU, DECODER_MENU, DECODER_MENU,DECODER_MENU,Menu_Decoder},    

};

#if 0
/**
  * @brief  This function is change Str to int.
  * @param  str
  * @retval int
  */

u16 Str_To_Int(u8 *str)
{
    u16 tmp=0; 
//     tmp=(str[0]-'0')*1000;
    tmp+=(str[1])*100;
    tmp+=(str[2])*10;
    tmp+=(str[3]);
    return tmp;
}

/**
  * @brief  This function is change Str to int.
  * @param  str
  * @retval int
  */

void Int_To_Str(u16 dat,u8 *str)
{
    u16 tmp;
    if(dat>15999) dat=0;
    str[0]=dat/1000;
    tmp=dat%1000;
    str[1]=tmp/100;
    tmp=tmp%100;
    str[2]=tmp/10;
    str[3]=tmp%10;
    str[4]=0;
}
#endif

/**
  * @brief  This function is add number of buff add one.
  * @param  str
  * @retval None
  */

void Buff_Add_One(u8 * str)
{
    if (str[3] == 9)
    {
        if (str[2] == 9)
        {
            if (str[1] == 9)
            {
                str[0]++;
                str[1] = 0;
                str[2] = 0;
                if (str[0] == 21)
                {
                    str[0] = 0;
                    str[3] = 1;
                }
                else
                {
                    str[3] = 1;
                }
            }
            else
            {
                str[1]++;
                str[2] = 0;
                str[3] = 0;
            }
        }
        else
        {
            str[2]++;
            str[3] = 0;
        }
    }
    else
    {
        str[3]++;
    }
}

/**
  * @brief  This function is Play_Navigation_Voice.
  * @param  data
  * @retval None
  */

void Play_Navigation_Voice(u8 data)
{
    if(gKeyValue == KEY_VALUE_MAIN && Set_Voice_Navigation_On_Or_OFF == 1)
    {
        Specify_Music_Play(data);
    }
    else if(gKeyValue == KEY_VALUE_UP && Set_Voice_Navigation_On_Or_OFF == 1)
    {
        Specify_Music_Play(data);
    }
    else if(gKeyValue == KEY_VALUE_DOWN && Set_Voice_Navigation_On_Or_OFF == 1)
    {
        Specify_Music_Play(data);
    }
    else if(gKeyValue == KEY_VALUE_ESC && Set_Voice_Navigation_On_Or_OFF == 1)
    {
        Specify_Music_Play(data);
    }
}

/**
  * @brief  This function is Time change.
  * @param  data
  * @retval None
  */
void Buff_Time_To_Struct_Time(u8 *buff,struct rtc_time *tm)
{
    tm->tm_year = buff[1]+2000;
    tm->tm_mon = buff[2];
    tm->tm_mday = buff[3];
    tm->tm_hour = buff[4];
    tm->tm_min = buff[5];
    tm->tm_sec = buff[6];
    tm->tm_wday = buff[7];
}

void Struct_Time_To_Buff_Time(struct rtc_time *tm,u8 *buff)
{
    buff[1] = tm->tm_year-2000;
    buff[2] = tm->tm_mon;
    buff[3] = tm->tm_mday;
    buff[4] = tm->tm_hour ;
    buff[5] = tm->tm_min ;
    buff[6] = tm->tm_sec ;
    buff[7] = tm->tm_wday;
}

/**
  * @brief  This function is Time_Adjust.
  * @param  None
  * @retval None
  */
  
void Time_Adjust(struct rtc_time *tm)
{
    /* Wait until last write operation on RTC registers has finished */
    RTC_WaitForLastTask();
    //printf("RTC_WaitForLastTask \r\n");
    Buff_Time_To_Struct_Time(Tm1629_Test_Time,tm);
    //printf("Buff_Time_To_Struct_Time \r\n");
    /* Get wday */
    //GregorianDay(tm);
    //printf("GregorianDay \r\n");
    RTC_SetCounter(mktimev(tm));
    //printf("RTC_SetCounter \r\n");

    /* Wait until last write operation on RTC registers has finished */
    RTC_WaitForLastTask();
    //printf("RTC_WaitForLastTask \r\n");
}

/**
  * @brief  This function is Show TM1629 of Standby menu.
  * @param  None
  * @retval None
  */

void Menu_Standby(void)
{
    static u8 Standby_index=0;
    if(Decoder_Call_Save_Queue[0] == 0 )
    {
#ifdef STM32_RECIVER
        if(Change_Standby_Display_Mode == 0)
#endif
        {
#ifdef STM32_RECIVER
            Tm1629_Clear();
            Tm1629_Display_Ram[0][Standby_index&0x03]=0x40; /* - */
            Tm1629_Display();
            Standby_index++;
#endif

#ifdef STM32_TRANSMIT
            Tm1629_Clear();
            Tm1629_Show_Call_Number(Transmit_Data);
            Tm1629_Show_Printer_Number(Queue_Number);
            Tm1629_Show_Number_Of_Call();
            Tm1629_Show_Number_Of_Wait();
            Tm1629_Display_Ram[0][Standby_index&0x03]=0x40; /* - */
            Tm1629_Display();
            Standby_index++;
#endif
        }
#ifdef STM32_RECIVER
        else
        {
            to_tm(RTC_GetCounter()+28800, &systmtime);
            Struct_Time_To_Buff_Time(&systmtime, Tm1629_Test_Time);
            Tm1629_Show_Time(Tm1629_Test_Time);    
        }
#endif
    }
/*
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        Decoder_Function_Of_Down();
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        Decoder_Function_Of_Up();
    }
    else if(gKeyValue == KEY_VALUE_ESC)
    {
        Decoder_Function_Of_Esc();
    }
*/
}

/**
  * @brief  This function is Show TM1629 of F0 menu.
  * @param  None
  * @retval None
  */

void Menu_F0(void)
{
    Tm1629_Show_Fx(0x00);
    to_tm(RTC_GetCounter()+28800, &systmtime);
    Struct_Time_To_Buff_Time(&systmtime, Tm1629_Test_Time);
}

/**
  * @brief  This function is Show TM1629 of F1 menu.
  * @param  None
  * @retval None
  */
  
void Menu_F1(void)
{
    Tm1629_Show_Fx(0x01);
    Play_Navigation_Voice(CUNCHUSHEZHI);
}

/**
  * @brief  This function is Show TM1629 of F2 menu.
  * @param  None
  * @retval None
  */
  
void Menu_F2(void)
{
    Tm1629_Show_Fx(0x02);
    Play_Navigation_Voice(SHANGCHUSHEZHI);
}

/**
  * @brief  This function is Show TM1629 of F3 menu.
  * @param  None
  * @retval None
  */
  
void Menu_F3(void)
{
    Tm1629_Show_Fx(0x03);
    Play_Navigation_Voice(XIANSHISHEZHI);
}

/**
  * @brief  This function is Show TM1629 of F4 menu.
  * @param  None
  * @retval None
  */

