chenjiawei180/STM32-RE/USER/menu.c
void Menu_F4(void)
{
    Tm1629_Show_Fx(0x04);
    Play_Navigation_Voice(XIAOHAOSHEZHI);
}

/**
  * @brief  This function is Show TM1629 of F5 menu.
  * @param  None
  * @retval None
  */

void Menu_F5(void)
{
    Tm1629_Show_Fx(0x05);
    Play_Navigation_Voice(XUNHUANSHEZHI);
}

/**
  * @brief  This function is Show TM1629 of F6 menu.
  * @param  None
  * @retval None
  */
  
void Menu_F6(void)
{
    Tm1629_Show_Fx(0x06);
    Play_Navigation_Voice(YUYINSHEZHI);
}

/**
  * @brief  This function is Show TM1629 of F7 menu.
  * @param  None
  * @retval None
  */
  
void Menu_F7(void)
{
    Tm1629_Show_Fx(0x07);
    Play_Navigation_Voice(JIANPANSHEZHI);
}

/**
  * @brief  This function is Show TM1629 of F8 menu.
  * @param  None
  * @retval None
  */
  
void Menu_F8(void)
{
    Tm1629_Show_Fx(0x08);
    Play_Navigation_Voice(ANJIANSHEZHI);
}

/**
  * @brief  This function is Show TM1629 of F9 menu.
  * @param  None
  * @retval None
  */
  
void Menu_F9(void)
{
    Tm1629_Show_Fx(0x09);
    Play_Navigation_Voice(HUIFUSHEZHI);
}

/**
  * @brief  This function is Show TM1629 of FA menu.
  * @param  None
  * @retval None
  */
  
void Menu_FA(void)
{
    Tm1629_Show_Fx(0x0A);
}

/**
  * @brief  This function is Show TM1629 of FB menu.
  * @param  None
  * @retval None
  */
  
void Menu_FB(void)
{
    Tm1629_Show_Fx(0x0B);
}

/**
  * @brief  This function is Show TM1629 of FC menu.
  * @param  None
  * @retval None
  */
  
void Menu_FC(void)
{
    Tm1629_Show_Fx(0x0C);
}

/**
  * @brief  This function is Show TM1629 of FD menu.
  * @param  None
  * @retval None
  */
  
void Menu_FD(void)
{
    Tm1629_Show_Fx(0x0D);
}

/**
  * @brief  This function is Show TM1629 of FE menu.
  * @param  None
  * @retval None
  */
  
void Menu_FE(void)
{
    Tm1629_Show_Fx(0x0E);
}

/**
  * @brief  This function is Show TM1629 of F0 menu show Minute.
  * @param  None
  * @retval None
  */
  
void Menu_F0_Minute(void)
{
    Tm1629_Blink_Time_Minute();
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Tm1629_Test_Time[5] == 59)
            Tm1629_Test_Time[5]=0;
        else
            Tm1629_Test_Time[5]++;
        Time_Adjust(&systmtime);
        Tm1629_Show_Time(Tm1629_Test_Time);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Tm1629_Test_Time[5] == 0)
            Tm1629_Test_Time[5]=59;
        else
            Tm1629_Test_Time[5]--;
        Time_Adjust(&systmtime);
        Tm1629_Show_Time(Tm1629_Test_Time);
    }
}

/**
  * @brief  This function is Show TM1629 of F0 menu show Hour.
  * @param  None
  * @retval None
  */
  
void Menu_F0_Hour(void)
{
    Tm1629_Blink_Time_Hour();
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Tm1629_Test_Time[4] == 23)
            Tm1629_Test_Time[4]=0;
        else
            Tm1629_Test_Time[4]++;
        Time_Adjust(&systmtime);
        Tm1629_Show_Time(Tm1629_Test_Time);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Tm1629_Test_Time[4] == 0)
            Tm1629_Test_Time[4]=23;
        else
            Tm1629_Test_Time[4]--;
        Time_Adjust(&systmtime);
        Tm1629_Show_Time(Tm1629_Test_Time);
    }
}

/**
  * @brief  This function is Show TM1629 of F0 menu show Day.
  * @param  None
  * @retval None
  */
  
void Menu_F0_Day(void)
{
    Tm1629_Blink_Time_Day();
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Tm1629_Test_Time[3] == 31)
            Tm1629_Test_Time[3]=1;
        else
            Tm1629_Test_Time[3]++;
        Time_Adjust(&systmtime);
        Tm1629_Show_Time(Tm1629_Test_Time);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Tm1629_Test_Time[3] == 1)
            Tm1629_Test_Time[3]=31;
        else
            Tm1629_Test_Time[3]--;
        Time_Adjust(&systmtime);
        Tm1629_Show_Time(Tm1629_Test_Time);
    }
}

/**
  * @brief  This function is Show TM1629 of F0 menu show Month.
  * @param  None
  * @retval None
  */
  
void Menu_F0_Month(void)
{
    Tm1629_Blink_Time_Month();
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Tm1629_Test_Time[2] == 12)
            Tm1629_Test_Time[2]=1;
        else
            Tm1629_Test_Time[2]++;
        Time_Adjust(&systmtime);
        Tm1629_Show_Time(Tm1629_Test_Time);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Tm1629_Test_Time[2] == 1)
            Tm1629_Test_Time[2]=12;
        else
            Tm1629_Test_Time[2]--;
        Time_Adjust(&systmtime);
        Tm1629_Show_Time(Tm1629_Test_Time);
    }
}

/**
  * @brief  This function is Show TM1629 of F0 menu show Year.
  * @param  None
  * @retval None
  */
  
void Menu_F0_Year(void)
{
    Tm1629_Blink_Time_Year();
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Tm1629_Test_Time[1] == 99)
            Tm1629_Test_Time[1]=0;
        else
            Tm1629_Test_Time[1]++;
        Time_Adjust(&systmtime);
        Tm1629_Show_Time(Tm1629_Test_Time);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Tm1629_Test_Time[1] == 0)
            Tm1629_Test_Time[1]=99;
        else
            Tm1629_Test_Time[1]--;
        Time_Adjust(&systmtime);
        Tm1629_Show_Time(Tm1629_Test_Time);
    }
}

/**
  * @brief  This function is Show TM1629 of F0 menu show Week.
  * @param  None
  * @retval None
  */

void Menu_F0_Week(void)
{
    Tm1629_Blink_Time_Week();
/*
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Tm1629_Test_Time[7] == 6)
            Tm1629_Test_Time[7]=0;
        else
            Tm1629_Test_Time[7]++;
        Time_Adjust(&systmtime);
        Tm1629_Show_Time(Tm1629_Test_Time);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Tm1629_Test_Time[7] == 0)
            Tm1629_Test_Time[7]=6;
        else
            Tm1629_Test_Time[7]--;
        Time_Adjust(&systmtime);
        Tm1629_Show_Time(Tm1629_Test_Time);
    }
*/
}

/**
  * @brief  This function is Show sub menu of F1. E1
  * @param  None
  * @retval None
  */
  
void Menu_F1_E1(void)
{
    Tm1629_Show_Ex(0x01);
}

/**
  * @brief  This function is Show sub menu of F1. E2
  * @param  None
  * @retval None
  */
  
void Menu_F1_E2(void)
{
    Tm1629_Show_Ex(0x02);
}

/**
  * @brief  This function is Show sub menu of F1. E3
  * @param  None
  * @retval None
  */
  
void Menu_F1_E3(void)
{
    Tm1629_Show_Ex(0x03);
}

/**
  * @brief  This function is Show sub menu of F1. E4
  * @param  None
  * @retval None
  */
  
void Menu_F1_E4(void)
{
    Tm1629_Show_Ex(0x04);
}

/**
  * @brief  This function is Show sub menu of F2. E1
  * @param  None
  * @retval None
  */
  
void Menu_F2_E1(void)
{
    Tm1629_Show_Ex(0x01);
}

/**
  * @brief  This function is Show sub menu of F2. E2
  * @param  None
  * @retval None
  */
  
