chenjiawei180/STM32-RE/USER/menu.c
void Menu_F2_E2(void)
{
    Tm1629_Show_Ex(0x02);
}

/**
  * @brief  This function is Show sub menu of F2. E3
  * @param  None
  * @retval None
  */
  
void Menu_F2_E3(void)
{
    Tm1629_Show_Ex(0x03);
}

/**
  * @brief  This function is Show sub menu of F2. E4
  * @param  None
  * @retval None
  */
  
void Menu_F2_E4(void)
{
    Tm1629_Show_Ex(0x04);
}

/**
  * @brief  This function is Show sub menu of F3. E1
  * @param  None
  * @retval None
  */
  
void Menu_F3_E1(void)
{
    Tm1629_Show_Ex(0x01);
}

/**
  * @brief  This function is Show sub menu of F3. E2
  * @param  None
  * @retval None
  */
  
void Menu_F3_E2(void)
{
    Tm1629_Show_Ex(0x02);
}

/**
  * @brief  This function is Show menu of F4.
  * @param  None
  * @retval None
  */
  
void Menu_F4_Set(void)
{
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Remove_Call_Time == 99)
            Remove_Call_Time=0;
        else
            Remove_Call_Time++;
 	 Env_Save();
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Remove_Call_Time == 0)
            Remove_Call_Time=99;
        else
            Remove_Call_Time--;
	 Env_Save();
    }
    Tm1629_Show_Two_Number(Remove_Call_Time); 
}

/**
  * @brief  This function is Show menu of F5.
  * @param  None
  * @retval None
  */
  
void Menu_F5_Set(void)
{
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Cycle_Call_Time== 99)
            Cycle_Call_Time=0;
        else
            Cycle_Call_Time++;
	 Env_Save();
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Cycle_Call_Time == 0)
            Cycle_Call_Time=99;
        else
            Cycle_Call_Time--;
	 Env_Save();
    }
    Tm1629_Show_Two_Number(Cycle_Call_Time); 
}

/**
  * @brief  This function is Show sub menu of F6. E1
  * @param  None
  * @retval None
  */
  
void Menu_F6_E1(void)
{
    Tm1629_Show_Ex(0x01);
}

/**
  * @brief  This function is Show sub menu of F6. E2
  * @param  None
  * @retval None
  */
  
void Menu_F6_E2(void)
{
    Tm1629_Show_Ex(0x02);
}

/**
  * @brief  This function is Show sub menu of F6. E3
  * @param  None
  * @retval None
  */
  
void Menu_F6_E3(void)
{
    Tm1629_Show_Ex(0x03);
}

/**
  * @brief  This function is Show sub menu of F6. E4
  * @param  None
  * @retval None
  */
  
void Menu_F6_E4(void)
{
    Tm1629_Show_Ex(0x04);
}


/**
  * @brief  This function is Show sub menu of F6. E5
  * @param  None
  * @retval None
  */
  
void Menu_F6_E5(void)
{
    Tm1629_Show_Ex(0x05);
}

/**
  * @brief  This function is Show sub menu of F6. E6
  * @param  None
  * @retval None
  */
  
void Menu_F6_E6(void)
{
    Tm1629_Show_Ex(0x06);
}

/**
  * @brief  This function is Show sub menu of F6. E7
  * @param  None
  * @retval None
  */
  
void Menu_F6_E7(void)
{
    Tm1629_Show_Ex(0x07);
}

/**
  * @brief  This function is Show sub menu of F6. E8
  * @param  None
  * @retval None
  */
  
void Menu_F6_E8(void)
{
    Tm1629_Show_Ex(0x08);
}

/**
  * @brief  This function is Show sub menu of F7. E1
  * @param  None
  * @retval None
  */
  
void Menu_F7_E1(void)
{
    Tm1629_Show_Ex(0x01);
}

/**
  * @brief  This function is Show sub menu of F7. E2
  * @param  None
  * @retval None
  */
  
void Menu_F7_E2(void)
{
    Tm1629_Show_Ex(0x02);
}

/**
  * @brief  This function is Show sub menu of F7. E3
  * @param  None
  * @retval None
  */
  
void Menu_F7_E3(void)
{
    Tm1629_Show_Ex(0x03);
}

/**
  * @brief  This function is Show sub menu of F7. E4
  * @param  None
  * @retval None
  */
  
void Menu_F7_E4(void)
{
    Tm1629_Show_Ex(0x04);
}

/**
  * @brief  This function is Show sub menu of F8. E1
  * @param  None
  * @retval None
  */
  
void Menu_F8_E1(void)
{
    Tm1629_Show_Ex(0x01);
    Set_Singal_Or_Multiple_Key_Mode_Bak = Set_Singal_Or_Multiple_Key_Mode;
}

/**
  * @brief  This function is Show sub menu of F8. E2
  * @param  None
  * @retval None
  */
  
void Menu_F8_E2(void)
{
    Tm1629_Show_Ex(0x02);
    Set_Key_Of_Call_Mode = 0;
}

/**
  * @brief  This function is Show sub menu of F9. E1
  * @param  None
  * @retval None
  */
  
void Menu_F9_E1(void)
{
    Tm1629_Show_Ex(0x01);
}

/**
  * @brief  This function is Show sub menu of F9. E2
  * @param  None
  * @retval None
  */
  
void Menu_F9_E2(void)
{
    Tm1629_Show_Ex(0x02);
}

/**
  * @brief  This function is Show menu of FA.
  * @param  None
  * @retval None
  */
  
void Menu_FA_Set(void)
{
    ;
}

/**
  * @brief  This function is Show menu of FB.
  * @param  None
  * @retval None
  */
  
void Menu_FB_Set(void)
{
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Set_Key_Remove_Call_Is_Or_Not == 1)
            Set_Key_Remove_Call_Is_Or_Not = 0;
        else
            Set_Key_Remove_Call_Is_Or_Not = 1;
	 Env_Save();
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Set_Key_Remove_Call_Is_Or_Not == 1)
            Set_Key_Remove_Call_Is_Or_Not = 0;
        else
            Set_Key_Remove_Call_Is_Or_Not = 1;
	 Env_Save();
    }
    Tm1629_Show_One_Number(Set_Key_Remove_Call_Is_Or_Not); 
}

/**
  * @brief  This function is Show menu of FC.
  * @param  None
  * @retval None
  */
  
void Menu_FC_Set(void)
{
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Change_Standby_Display_Mode== 1)
            Change_Standby_Display_Mode = 0;
        else
            Change_Standby_Display_Mode = 1;
	 Env_Save();
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Change_Standby_Display_Mode == 1)
            Change_Standby_Display_Mode = 0;
        else
            Change_Standby_Display_Mode = 1;
	 Env_Save();
    }
    Tm1629_Show_One_Number(Change_Standby_Display_Mode); 
}

/**
  * @brief  This function is Show menu of FD.
  * @param  None
  * @retval None
  */
  
void Menu_FD_Set(void)
{
    static u8 index=0;
    if(index <= 20)
    {
        if(index < 4)
        {
            Tm1629_Display_Test(0xff);
        }
	 else if(index <= 18)
        {
            Tm1629_Display_Test(INIT_CODE[index / 2 - 2]);
        }
	 else
	 {
	     Tm1629_Display_Test(0xff);
	 }
    }
    else
    {
        Tm1629_Clear();
	 Tm1629_Display();
    }
    if(index > 24) 
    {
        index = 0;
    }
    index++;

    if(GD5800_Busy_Soft_Table && GD5800_Busy_Hard_Table)
    {
        Specify_Music_Play(YINGYUEYI);
    }
    
