chenjiawei180/STM32-RE/USER/menu.c
}

/**
  * @brief  This function is Show sub menu of FE. E1
  * @param  None
  * @retval None
  */
  
void Menu_FE_E1(void)
{
    Tm1629_Show_Ex(0x01);
}

/**
  * @brief  This function is Show sub menu of FE. E2
  * @param  None
  * @retval None
  */
  
void Menu_FE_E2(void)
{
    Tm1629_Show_Ex(0x02);
}

/**
  * @brief  This function is Show sub menu of F1. E1. D1
  * @param  None
  * @retval None
  */
  
void  Menu_F1_E1_D1(void)
{
    Tm1629_Blink_One_Position(Register_Call_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Register_Call_Buff[3] == 9)
            Register_Call_Buff[3]=0;
        else
            Register_Call_Buff[3]++;
        Tm1629_Show_Four_Number(Register_Call_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Register_Call_Buff[3] == 0)
            Register_Call_Buff[3]=9;
        else
            Register_Call_Buff[3]--;
        Tm1629_Show_Four_Number(Register_Call_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F1. E1. D2
  * @param  None
  * @retval None
  */
  
void  Menu_F1_E1_D2(void)
{
    Tm1629_Blink_Two_Position(Register_Call_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Register_Call_Buff[2] == 9)
            Register_Call_Buff[2]=0;
        else
            Register_Call_Buff[2]++;
        Tm1629_Show_Four_Number(Register_Call_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Register_Call_Buff[2] == 0)
            Register_Call_Buff[2]=9;
        else
            Register_Call_Buff[2]--;
        Tm1629_Show_Four_Number(Register_Call_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F1. E1. D3
  * @param  None
  * @retval None
  */
  
void  Menu_F1_E1_D3(void)
{
    Tm1629_Blink_Three_Position(Register_Call_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Register_Call_Buff[1] == 9)
            Register_Call_Buff[1]=0;
        else
            Register_Call_Buff[1]++;
        Tm1629_Show_Four_Number(Register_Call_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Register_Call_Buff[1] == 0)
            Register_Call_Buff[1]=9;
        else
            Register_Call_Buff[1]--;
        Tm1629_Show_Four_Number(Register_Call_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F1. E1. D4
  * @param  None
  * @retval None
  */
  
void  Menu_F1_E1_D4(void)
{
    Tm1629_Blink_Four_Position(Register_Call_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Register_Call_Buff[0] == 9)
            Register_Call_Buff[0]=0;
        else
            Register_Call_Buff[0]++;
        Tm1629_Show_Four_Number(Register_Call_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Register_Call_Buff[0] == 0)
            Register_Call_Buff[0]=9;
        else
            Register_Call_Buff[0]--;
        Tm1629_Show_Four_Number(Register_Call_Buff);
    }
}


/**
  * @brief  This function is Show sub menu of F1. E2. D1
  * @param  None
  * @retval None
  */
  
void  Menu_F1_E2_D1(void)
{
    Tm1629_Blink_One_Position(Register_Host_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Register_Host_Buff[3] == 9)
            Register_Host_Buff[3]=0;
        else
            Register_Host_Buff[3]++;
        Tm1629_Show_Four_Number(Register_Host_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Register_Host_Buff[3] == 0)
            Register_Host_Buff[3]=9;
        else
            Register_Host_Buff[3]--;
        Tm1629_Show_Four_Number(Register_Host_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F1. E2. D2
  * @param  None
  * @retval None
  */
  
void  Menu_F1_E2_D2(void)
{
    Tm1629_Blink_Two_Position(Register_Host_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Register_Host_Buff[2] == 9)
            Register_Host_Buff[2]=0;
        else
            Register_Host_Buff[2]++;
        Tm1629_Show_Four_Number(Register_Host_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Register_Host_Buff[2] == 0)
            Register_Host_Buff[2]=9;
        else
            Register_Host_Buff[2]--;
        Tm1629_Show_Four_Number(Register_Host_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F1. E2. D3
  * @param  None
  * @retval None
  */
  
void  Menu_F1_E2_D3(void)
{
    Tm1629_Blink_Three_Position(Register_Host_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Register_Host_Buff[1] == 9)
            Register_Host_Buff[1]=0;
        else
            Register_Host_Buff[1]++;
        Tm1629_Show_Four_Number(Register_Host_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Register_Host_Buff[1] == 0)
            Register_Host_Buff[1]=9;
        else
            Register_Host_Buff[1]--;
        Tm1629_Show_Four_Number(Register_Host_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F1. E2. D4
  * @param  None
  * @retval None
  */
  
void  Menu_F1_E2_D4(void)
{
    Tm1629_Blink_Four_Position(Register_Host_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Register_Host_Buff[0] == 9)
            Register_Host_Buff[0]=0;
        else
            Register_Host_Buff[0]++;
        Tm1629_Show_Four_Number(Register_Host_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Register_Host_Buff[0] == 0)
            Register_Host_Buff[0]=9;
        else
            Register_Host_Buff[0]--;
        Tm1629_Show_Four_Number(Register_Host_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F1. E3. D1
  * @param  None
  * @retval None
  */
  
void  Menu_F1_E3_D1(void)
{
    Tm1629_Blink_One_Position(Register_Alarm_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Register_Alarm_Buff[3] == 9)
            Register_Alarm_Buff[3]=0;
        else
            Register_Alarm_Buff[3]++;
        Tm1629_Show_Four_Number(Register_Alarm_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Register_Alarm_Buff[3] == 0)
            Register_Alarm_Buff[3]=9;
        else
            Register_Alarm_Buff[3]--;
        Tm1629_Show_Four_Number(Register_Alarm_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F1. E3. D2
  * @param  None
  * @retval None
  */
  
void  Menu_F1_E3_D2(void)
{
    Tm1629_Blink_Two_Position(Register_Alarm_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Register_Alarm_Buff[2] == 9)
            Register_Alarm_Buff[2]=0;
        else
            Register_Alarm_Buff[2]++;
        Tm1629_Show_Four_Number(Register_Alarm_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Register_Alarm_Buff[2] == 0)
            Register_Alarm_Buff[2]=9;
        else
            Register_Alarm_Buff[2]--;
        Tm1629_Show_Four_Number(Register_Alarm_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F1. E3. D3
  * @param  None
  * @retval None
  */
  
void  Menu_F1_E3_D3(void)
{
    Tm1629_Blink_Three_Position(Register_Alarm_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Register_Alarm_Buff[1] == 9)
            Register_Alarm_Buff[1]=0;
        else
            Register_Alarm_Buff[1]++;
        Tm1629_Show_Four_Number(Register_Alarm_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Register_Alarm_Buff[1] == 0)
            Register_Alarm_Buff[1]=9;
        else
            Register_Alarm_Buff[1]--;
        Tm1629_Show_Four_Number(Register_Alarm_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F1. E3. D4
  * @param  None
  * @retval None
  */
  
void  Menu_F1_E3_D4(void)
{
    Tm1629_Blink_Four_Position(Register_Alarm_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Register_Alarm_Buff[0] == 9)
            Register_Alarm_Buff[0]=0;
        else
            Register_Alarm_Buff[0]++;
        Tm1629_Show_Four_Number(Register_Alarm_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Register_Alarm_Buff[0] == 0)
            Register_Alarm_Buff[0]=9;
        else
            Register_Alarm_Buff[0]--;
        Tm1629_Show_Four_Number(Register_Alarm_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F1. E4. D1
  * @param  None
  * @retval None
  */
  
void  Menu_F1_E4_D1(void)
{
    Tm1629_Blink_One_Position(Register_Cancel_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Register_Cancel_Buff[3] == 9)
            Register_Cancel_Buff[3]=0;
        else
            Register_Cancel_Buff[3]++;
        Tm1629_Show_Four_Number(Register_Cancel_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Register_Cancel_Buff[3] == 0)
            Register_Cancel_Buff[3]=9;
        else
            Register_Cancel_Buff[3]--;
        Tm1629_Show_Four_Number(Register_Cancel_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F1. E4. D2
  * @param  None
  * @retval None
  */
  
