chenjiawei180/STM32-RE/USER/menu.c
void  Menu_F1_E4_D2(void)
{
    Tm1629_Blink_Two_Position(Register_Cancel_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Register_Cancel_Buff[2] == 9)
            Register_Cancel_Buff[2]=0;
        else
            Register_Cancel_Buff[2]++;
        Tm1629_Show_Four_Number(Register_Cancel_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Register_Cancel_Buff[2] == 0)
            Register_Cancel_Buff[2]=9;
        else
            Register_Cancel_Buff[2]--;
        Tm1629_Show_Four_Number(Register_Cancel_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F1. E4. D3
  * @param  None
  * @retval None
  */
  
void  Menu_F1_E4_D3(void)
{
    Tm1629_Blink_Three_Position(Register_Cancel_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Register_Cancel_Buff[1] == 9)
            Register_Cancel_Buff[1]=0;
        else
            Register_Cancel_Buff[1]++;
        Tm1629_Show_Four_Number(Register_Cancel_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Register_Cancel_Buff[1] == 0)
            Register_Cancel_Buff[1]=9;
        else
            Register_Cancel_Buff[1]--;
        Tm1629_Show_Four_Number(Register_Cancel_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F1. E4. D4
  * @param  None
  * @retval None
  */
  
void  Menu_F1_E4_D4(void)
{
    Tm1629_Blink_Four_Position(Register_Cancel_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Register_Cancel_Buff[0] == 9)
            Register_Cancel_Buff[0]=0;
        else
            Register_Cancel_Buff[0]++;
        Tm1629_Show_Four_Number(Register_Cancel_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Register_Cancel_Buff[0] == 0)
            Register_Cancel_Buff[0]=9;
        else
            Register_Cancel_Buff[0]--;
        Tm1629_Show_Four_Number(Register_Cancel_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F2. E1. D1
  * @param  None
  * @retval None
  */
  
void  Menu_F2_E1_D1(void)
{
    Tm1629_Blink_One_Position(Delete_Call_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Delete_Call_Buff[3] == 9)
            Delete_Call_Buff[3]=0;
        else
            Delete_Call_Buff[3]++;
        Tm1629_Show_Four_Number(Delete_Call_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Delete_Call_Buff[3] == 0)
            Delete_Call_Buff[3]=9;
        else
            Delete_Call_Buff[3]--;
        Tm1629_Show_Four_Number(Delete_Call_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F2. E1. D2
  * @param  None
  * @retval None
  */
  
void  Menu_F2_E1_D2(void)
{
    Tm1629_Blink_Two_Position(Delete_Call_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Delete_Call_Buff[2] == 9)
            Delete_Call_Buff[2]=0;
        else
            Delete_Call_Buff[2]++;
        Tm1629_Show_Four_Number(Delete_Call_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Delete_Call_Buff[2] == 0)
            Delete_Call_Buff[2]=9;
        else
            Delete_Call_Buff[2]--;
        Tm1629_Show_Four_Number(Delete_Call_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F2. E1. D3
  * @param  None
  * @retval None
  */
  
void  Menu_F2_E1_D3(void)
{
    Tm1629_Blink_Three_Position(Delete_Call_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Delete_Call_Buff[1] == 9)
            Delete_Call_Buff[1]=0;
        else
            Delete_Call_Buff[1]++;
        Tm1629_Show_Four_Number(Delete_Call_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Delete_Call_Buff[1] == 0)
            Delete_Call_Buff[1]=9;
        else
            Delete_Call_Buff[1]--;
        Tm1629_Show_Four_Number(Delete_Call_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F2. E1. D4
  * @param  None
  * @retval None
  */
  
void  Menu_F2_E1_D4(void)
{
    Tm1629_Blink_Four_Position(Delete_Call_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Delete_Call_Buff[0] == 9)
            Delete_Call_Buff[0]=0;
        else
            Delete_Call_Buff[0]++;
        Tm1629_Show_Four_Number(Delete_Call_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Delete_Call_Buff[0] == 0)
            Delete_Call_Buff[0]=9;
        else
            Delete_Call_Buff[0]--;
        Tm1629_Show_Four_Number(Delete_Call_Buff);
    }
}



/**
  * @brief  This function is Show sub menu of F2. E2. D1
  * @param  None
  * @retval None
  */
  
void  Menu_F2_E2_D1(void)
{
    Tm1629_Blink_One_Position(Delete_Host_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Delete_Host_Buff[3] == 9)
            Delete_Host_Buff[3]=0;
        else
            Delete_Host_Buff[3]++;
        Tm1629_Show_Four_Number(Delete_Host_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Delete_Host_Buff[3] == 0)
            Delete_Host_Buff[3]=9;
        else
            Delete_Host_Buff[3]--;
        Tm1629_Show_Four_Number(Delete_Host_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F2. E2. D2
  * @param  None
  * @retval None
  */
  
void  Menu_F2_E2_D2(void)
{
    Tm1629_Blink_Two_Position(Delete_Host_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Delete_Host_Buff[2] == 9)
            Delete_Host_Buff[2]=0;
        else
            Delete_Host_Buff[2]++;
        Tm1629_Show_Four_Number(Delete_Host_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Delete_Host_Buff[2] == 0)
            Delete_Host_Buff[2]=9;
        else
            Delete_Host_Buff[2]--;
        Tm1629_Show_Four_Number(Delete_Host_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F2. E2. D3
  * @param  None
  * @retval None
  */
  
void  Menu_F2_E2_D3(void)
{
    Tm1629_Blink_Three_Position(Delete_Host_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Delete_Host_Buff[1] == 9)
            Delete_Host_Buff[1]=0;
        else
            Delete_Host_Buff[1]++;
        Tm1629_Show_Four_Number(Delete_Host_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Delete_Host_Buff[1] == 0)
            Delete_Host_Buff[1]=9;
        else
            Delete_Host_Buff[1]--;
        Tm1629_Show_Four_Number(Delete_Host_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F2. E2. D4
  * @param  None
  * @retval None
  */
  
void  Menu_F2_E2_D4(void)
{
    Tm1629_Blink_Four_Position(Delete_Host_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Delete_Host_Buff[0] == 9)
            Delete_Host_Buff[0]=0;
        else
            Delete_Host_Buff[0]++;
        Tm1629_Show_Four_Number(Delete_Host_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Delete_Host_Buff[0] == 0)
            Delete_Host_Buff[0]=9;
        else
            Delete_Host_Buff[0]--;
        Tm1629_Show_Four_Number(Delete_Host_Buff);
    }
}


/**
  * @brief  This function is Show sub menu of F2. E3. D1
  * @param  None
  * @retval None
  */
  
void  Menu_F2_E3_D1(void)
{
    Tm1629_Blink_One_Position(Delete_Alarm_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Delete_Alarm_Buff[3] == 9)
            Delete_Alarm_Buff[3]=0;
        else
            Delete_Alarm_Buff[3]++;
        Tm1629_Show_Four_Number(Delete_Alarm_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Delete_Alarm_Buff[3] == 0)
            Delete_Alarm_Buff[3]=9;
        else
            Delete_Alarm_Buff[3]--;
        Tm1629_Show_Four_Number(Delete_Alarm_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F2. E3. D2
  * @param  None
  * @retval None
  */
  
void  Menu_F2_E3_D2(void)
{
    Tm1629_Blink_Two_Position(Delete_Alarm_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Delete_Alarm_Buff[2] == 9)
            Delete_Alarm_Buff[2]=0;
        else
            Delete_Alarm_Buff[2]++;
        Tm1629_Show_Four_Number(Delete_Alarm_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Delete_Alarm_Buff[2] == 0)
            Delete_Alarm_Buff[2]=9;
        else
            Delete_Alarm_Buff[2]--;
        Tm1629_Show_Four_Number(Delete_Alarm_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F2. E3. D3
  * @param  None
  * @retval None
  */
  
void  Menu_F2_E3_D3(void)
{
    Tm1629_Blink_Three_Position(Delete_Alarm_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Delete_Alarm_Buff[1] == 9)
            Delete_Alarm_Buff[1]=0;
        else
            Delete_Alarm_Buff[1]++;
        Tm1629_Show_Four_Number(Delete_Alarm_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Delete_Alarm_Buff[1] == 0)
            Delete_Alarm_Buff[1]=9;
        else
            Delete_Alarm_Buff[1]--;
        Tm1629_Show_Four_Number(Delete_Alarm_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F2. E3. D4
  * @param  None
  * @retval None
  */
  
void  Menu_F2_E3_D4(void)
{
    Tm1629_Blink_Four_Position(Delete_Alarm_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Delete_Alarm_Buff[0] == 9)
            Delete_Alarm_Buff[0]=0;
        else
            Delete_Alarm_Buff[0]++;
        Tm1629_Show_Four_Number(Delete_Alarm_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Delete_Alarm_Buff[0] == 0)
            Delete_Alarm_Buff[0]=9;
        else
            Delete_Alarm_Buff[0]--;
        Tm1629_Show_Four_Number(Delete_Alarm_Buff);
    }
}


/**
  * @brief  This function is Show sub menu of F2. E4. D1
  * @param  None
  * @retval None
  */
  
void  Menu_F2_E4_D1(void)
{
    Tm1629_Blink_One_Position(Delete_Cancel_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Delete_Cancel_Buff[3] == 9)
            Delete_Cancel_Buff[3]=0;
        else
            Delete_Cancel_Buff[3]++;
        Tm1629_Show_Four_Number(Delete_Cancel_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Delete_Cancel_Buff[3] == 0)
            Delete_Cancel_Buff[3]=9;
        else
            Delete_Cancel_Buff[3]--;
        Tm1629_Show_Four_Number(Delete_Cancel_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F2. E4. D2
  * @param  None
  * @retval None
  */
  
void  Menu_F2_E4_D2(void)
{
    Tm1629_Blink_Two_Position(Delete_Cancel_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Delete_Cancel_Buff[2] == 9)
            Delete_Cancel_Buff[2]=0;
        else
            Delete_Cancel_Buff[2]++;
        Tm1629_Show_Four_Number(Delete_Cancel_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Delete_Cancel_Buff[2] == 0)
            Delete_Cancel_Buff[2]=9;
        else
            Delete_Cancel_Buff[2]--;
        Tm1629_Show_Four_Number(Delete_Cancel_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F2. E4. D3
  * @param  None
  * @retval None
  */
  
void  Menu_F2_E4_D3(void)
{
    Tm1629_Blink_Three_Position(Delete_Cancel_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Delete_Cancel_Buff[1] == 9)
            Delete_Cancel_Buff[1]=0;
        else
            Delete_Cancel_Buff[1]++;
        Tm1629_Show_Four_Number(Delete_Cancel_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Delete_Cancel_Buff[1] == 0)
            Delete_Cancel_Buff[1]=9;
        else
            Delete_Cancel_Buff[1]--;
        Tm1629_Show_Four_Number(Delete_Cancel_Buff);
    }
}

/**
  * @brief  This function is Show sub menu of F2. E4. D4
  * @param  None
  * @retval None
  */
  
