chenjiawei180/STM32-RE/USER/menu.c
void  Menu_F2_E4_D4(void)
{
    Tm1629_Blink_Four_Position(Delete_Cancel_Buff);
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Delete_Cancel_Buff[0] == 9)
            Delete_Cancel_Buff[0]=0;
        else
            Delete_Cancel_Buff[0]++;
        Tm1629_Show_Four_Number(Delete_Cancel_Buff);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Delete_Cancel_Buff[0] == 0)
            Delete_Cancel_Buff[0]=9;
        else
            Delete_Cancel_Buff[0]--;
        Tm1629_Show_Four_Number(Delete_Cancel_Buff);
    }
}

/**
  * @brief  This function is Show menu of F3 E1 SET.
  * @param  None
  * @retval None
  */
  
void Menu_F3_E1_Set(void)
{
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Set_Call_Queue_Mode== 3)
            Set_Call_Queue_Mode = 1;
        else
            Set_Call_Queue_Mode++ ;
	Env_Save();
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Set_Call_Queue_Mode == 1)
            Set_Call_Queue_Mode = 3;
        else
            Set_Call_Queue_Mode --;
	Env_Save();
    }
    Tm1629_Show_One_Number(Set_Call_Queue_Mode); 
}

/**
  * @brief  This function is Show menu of F3 E2 SET
  * @param  None
  * @retval None
  */
  
void Menu_F3_E2_Set(void)
{
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Set_Call_Display_Number== 99)
            Set_Call_Display_Number=1;
        else
            Set_Call_Display_Number++;
	Env_Save();
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Set_Call_Display_Number == 1)
            Set_Call_Display_Number=99;
        else
            Set_Call_Display_Number--;
	Env_Save();
    }
    Tm1629_Show_Two_Number(Set_Call_Display_Number); 
}

/**
  * @brief  This function is Show menu of F6 E1 SET
  * @param  None
  * @retval None
  */
  
void Menu_F6_E1_Set(void)
{
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Set_Voice_Play_Mode== 7)
            Set_Voice_Play_Mode=0;
        else
            Set_Voice_Play_Mode++;
	 Env_Save();
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Set_Voice_Play_Mode == 0)
            Set_Voice_Play_Mode=7;
        else
            Set_Voice_Play_Mode--;
	 Env_Save();
    }
    Tm1629_Show_One_Number(Set_Voice_Play_Mode); 
}

/**
  * @brief  This function is Show menu of F6 E2 SET
  * @param  None
  * @retval None
  */
  
void Menu_F6_E2_Set(void)
{
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Set_Voice_Play_Time== 9)
            Set_Voice_Play_Time=1;
        else
            Set_Voice_Play_Time++;
	 Env_Save();
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Set_Voice_Play_Time == 1)
            Set_Voice_Play_Time=9;
        else
            Set_Voice_Play_Time--;
	 Env_Save();
    }
    Tm1629_Show_One_Number(Set_Voice_Play_Time); 
}

/**
  * @brief  This function is Show menu of F6 E3 SET.
  * @param  None
  * @retval None
  */
  
void Menu_F6_E3_Set(void)
{
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Set_Voice_Play_Is_Or_Not_In_Cycle_Mode== 1)
            Set_Voice_Play_Is_Or_Not_In_Cycle_Mode = 0;
        else
            Set_Voice_Play_Is_Or_Not_In_Cycle_Mode = 1;
	 Env_Save();
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Set_Voice_Play_Is_Or_Not_In_Cycle_Mode == 1)
            Set_Voice_Play_Is_Or_Not_In_Cycle_Mode = 0;
        else
            Set_Voice_Play_Is_Or_Not_In_Cycle_Mode = 1;
	 Env_Save();
    }
    Tm1629_Show_One_Number(Set_Voice_Play_Is_Or_Not_In_Cycle_Mode); 
}

/**
  * @brief  This function is Show menu of F6 E4 SET
  * @param  None
  * @retval None
  */
  
void Menu_F6_E4_Set(void)
{
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Set_Voice_Volume== 9)
            Set_Voice_Volume=1;
        else
            Set_Voice_Volume++;
        Specify_Volume(Set_Voice_Volume * 3);
	 Env_Save();
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Set_Voice_Volume == 1)
            Set_Voice_Volume=9;
        else
            Set_Voice_Volume--;
        Specify_Volume(Set_Voice_Volume * 3);
	 Env_Save();
    }
    Tm1629_Show_One_Number(Set_Voice_Volume); 
}

/**
  * @brief  This function is Show menu of F6 E5 SET
  * @param  None
  * @retval None
  */
  
void Menu_F6_E5_Set(void)
{
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Set_Display_Tube_Brightness== 7)
            Set_Display_Tube_Brightness=1;
        else
            Set_Display_Tube_Brightness++;
	 Env_Save();
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Set_Display_Tube_Brightness == 1)
            Set_Display_Tube_Brightness=7;
        else
            Set_Display_Tube_Brightness--;
	 Env_Save();
    }
    Tm1629_Show_One_Number(Set_Display_Tube_Brightness); 
}

/**
  * @brief  This function is Show menu of F6 E6 SET.
  * @param  None
  * @retval None
  */
  
void Menu_F6_E6_Set(void)
{
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Set_Voice_Navigation_On_Or_OFF== 1)
            Set_Voice_Navigation_On_Or_OFF = 0;
        else
            Set_Voice_Navigation_On_Or_OFF = 1;
	 Env_Save();
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Set_Voice_Navigation_On_Or_OFF == 1)
            Set_Voice_Navigation_On_Or_OFF = 0;
        else
            Set_Voice_Navigation_On_Or_OFF = 1;
	 Env_Save();
    }
    Tm1629_Show_One_Number(Set_Voice_Navigation_On_Or_OFF); 
}

/**
  * @brief  This function is Show menu of F6 E7 SET.
  * @param  None
  * @retval None
  */
  
void Menu_F6_E7_Set(void)
{
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Set_Voice_Navigation_Mode== 1)
            Set_Voice_Navigation_Mode = 0;
        else
            Set_Voice_Navigation_Mode = 1;
	 Env_Save();
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Set_Voice_Navigation_Mode == 1)
            Set_Voice_Navigation_Mode = 0;
        else
            Set_Voice_Navigation_Mode = 1;
	 Env_Save();
    }
    Tm1629_Show_One_Number(Set_Voice_Navigation_Mode); 
}

/**
  * @brief  This function is Show menu of F6 E8 SET.
  * @param  None
  * @retval None
  */
  
void Menu_F6_E8_Set(void)
{
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Set_Display_LED_Mode== 1)
            Set_Display_LED_Mode = 0;
        else
            Set_Display_LED_Mode = 1;
	 Env_Save();
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Set_Display_LED_Mode == 1)
            Set_Display_LED_Mode = 0;
        else
            Set_Display_LED_Mode = 1;
	 Env_Save();
    }
    Tm1629_Show_One_Number(Set_Display_LED_Mode); 
}

/**
  * @brief  This function is Show menu of F7 E1 SET
  * @param  None
  * @retval None
  */
  
