chenjiawei180/STM32-RE/USER/menu.c
void Menu_F7_E1_Set(void)
{
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Set_Two_Menu_F7_E1== 11)
            Set_Two_Menu_F7_E1=0;
        else
            Set_Two_Menu_F7_E1++;
	 Env_Save();
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Set_Two_Menu_F7_E1 == 0)
            Set_Two_Menu_F7_E1=11;
        else
            Set_Two_Menu_F7_E1--;
	 Env_Save();
    }
    if(Set_Two_Menu_F7_E1 < 10)
    {
        Tm1629_Show_One_Number(Set_Two_Menu_F7_E1); 
    }
    else if(Set_Two_Menu_F7_E1 == 11)
    {
        Tm1629_Clear();
	 Tm1629_Display_Ram[0][1] = Dis_TAB[0];
	 Tm1629_Display_Ram[0][0] = 0x37;
	 Tm1629_Display();
    }
    else
    {
        Tm1629_Clear();
	 Tm1629_Display_Ram[0][1] = Dis_TAB[0];
	 Tm1629_Display_Ram[0][0] = Dis_TAB[0x0f];
	 Tm1629_Display();
    }
}

/**
  * @brief  This function is Show menu of F7 E2 SET
  * @param  None
  * @retval None
  */
  
void Menu_F7_E2_Set(void)
{
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Set_Two_Menu_F7_E2== 11)
            Set_Two_Menu_F7_E2=0;
        else
            Set_Two_Menu_F7_E2++;
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Set_Two_Menu_F7_E2 == 0)
            Set_Two_Menu_F7_E2=11;
        else
            Set_Two_Menu_F7_E2--;
    }
    Tm1629_Show_Two_Number(Set_Two_Menu_F7_E2); 
}

/**
  * @brief  This function is Show menu of F7 E3 SET
  * @param  None
  * @retval None
  */
  
void Menu_F7_E3_Set(void)
{
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Set_Two_Menu_F7_E3== 11)
            Set_Two_Menu_F7_E3=0;
        else
            Set_Two_Menu_F7_E3++;
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Set_Two_Menu_F7_E3 == 0)
            Set_Two_Menu_F7_E3=11;
        else
            Set_Two_Menu_F7_E3--;
    }
    Tm1629_Show_Two_Number(Set_Two_Menu_F7_E3); 
}

/**
  * @brief  This function is Show menu of F7 E4 SET
  * @param  None
  * @retval None
  */
  
void Menu_F7_E4_Set(void)
{
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Set_Two_Menu_F7_E4== 11)
            Set_Two_Menu_F7_E4=0;
        else
            Set_Two_Menu_F7_E4++;
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Set_Two_Menu_F7_E4== 0)
            Set_Two_Menu_F7_E4=11;
        else
            Set_Two_Menu_F7_E4--;
    }
    Tm1629_Show_Two_Number(Set_Two_Menu_F7_E4); 
}

/**
  * @brief  This function is Show menu of F8 E1 SET.
  * @param  None
  * @retval None
  */
  
void Menu_F8_E1_Set(void)
{
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Set_Singal_Or_Multiple_Key_Mode== 1)
            Set_Singal_Or_Multiple_Key_Mode = 2;
        else
            Set_Singal_Or_Multiple_Key_Mode = 1;
	 Env_Save();
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Set_Singal_Or_Multiple_Key_Mode == 1)
            Set_Singal_Or_Multiple_Key_Mode = 2;
        else
            Set_Singal_Or_Multiple_Key_Mode = 1;
	 Env_Save();
    }
    Tm1629_Show_One_Number(Set_Singal_Or_Multiple_Key_Mode); 
    if(Set_Singal_Or_Multiple_Key_Mode_Bak != Set_Singal_Or_Multiple_Key_Mode)
    {
        Set_Singal_Or_Multiple_Key_Mode_Bak = Set_Singal_Or_Multiple_Key_Mode;
        Delete_All_Data();
    }
}

/**
  * @brief  This function is Show menu of F8 E2 SET
  * @param  None
  * @retval None
  */
  
void Menu_F8_E2_Set(void)
{
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        Specify_Music_Play(Set_Key_Of_Call_Mode + QUXIAO);
    }
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        if(Set_Key_Of_Call_Mode== 38)
            Set_Key_Of_Call_Mode=0;
        else
            Set_Key_Of_Call_Mode++;
        Specify_Music_Play(Set_Key_Of_Call_Mode + QUXIAO);
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        if(Set_Key_Of_Call_Mode== 0)
            Set_Key_Of_Call_Mode=38;
        else
            Set_Key_Of_Call_Mode--;	
        Specify_Music_Play(Set_Key_Of_Call_Mode + QUXIAO);
    }
    Tm1629_Show_Two_Number(Set_Key_Of_Call_Mode); 
}

/**
  * @brief  This function is Show menu of Decoder
  * @param  None
  * @retval None
  */
  
void Menu_Decoder(void)
{
    if(gKeyValue == KEY_VALUE_DOWN)
    {
        Decoder_Function_Of_Down();
    }
    else if(gKeyValue == KEY_VALUE_UP)
    {
        Decoder_Function_Of_Up();
    }
    else if(gKeyValue == KEY_VALUE_ESC)
    {
        Decoder_Function_Of_Esc();
    }
    if(Decoder_Call_Save_Queue[0] == 0)
    {
        M_index = STANDBY_MENU;
    }
    if(Decoder_Call_Save_Queue[0] == BAOJING_1)
    {
        if(GD5800_Busy_Soft_Table && GD5800_Busy_Hard_Table)
        {
            Specify_Music_Play(BAOJING);
        }
    }
}

#endif /* MENU_GLOBAL */

